## Missing Data

In [3]:
import numpy as np
import pandas as pd

In [5]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [7]:
df = pd.DataFrame(d)

In [9]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [11]:
df.dropna() ## Removal along rows axis = 0

     A    B  C
0  1.0  5.0  1

In [13]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [15]:
 df.dropna(axis=1) # Removal along columns ## Inplace = True, if needed

   C
0  1
1  2
2  3

In [17]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [19]:
df.fillna(value='Sample value')

              A             B  C
0           1.0           5.0  1
1           2.0  Sample value  2
2  Sample value  Sample value  3

In [21]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [23]:
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

## Group By Clause

## Group by method allows you to group rows of data together and then you can call aggregate functions

In [65]:
data = {'Company':['Google','Microsoft','FB','FB','Google','Microsoft'],
       'Person':['Sam','Amy','Carl','Carl','Sarah','Amy'],
       'Sales':[200,120,500,760,200,111]}

In [67]:
df=pd.DataFrame(data)

In [69]:
df

     Company Person  Sales
0     Google    Sam    200
1  Microsoft    Amy    120
2         FB   Carl    500
3         FB   Carl    760
4     Google  Sarah    200
5  Microsoft    Amy    111

In [71]:
df.groupby('Company').sum()

             Person  Sales
Company
FB         CarlCarl   1260
Google     SamSarah    400
Microsoft    AmyAmy    231

In [73]:
df.groupby('Company').count()

           Person  Sales
Company
FB              2      2
Google          2      2
Microsoft       2      2

In [75]:
df.groupby('Company').max()

          Person  Sales
Company
FB          Carl    760
Google     Sarah    200
Microsoft    Amy    120

In [77]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    500
Google       Sam    200
Microsoft    Amy    111

In [81]:
df.groupby('Company').describe()

          Sales
          count   mean         std    min     25%    50%     75%    max
Company
FB          2.0  630.0  183.847763  500.0  565.00  630.0  695.00  760.0
Google      2.0  200.0    0.000000  200.0  200.00  200.0  200.00  200.0
Microsoft   2.0  115.5    6.363961  111.0  113.25  115.5  117.75  120.0

In [83]:
df.groupby('Company').describe().transpose()

Company              FB  Google   Microsoft
Sales count    2.000000     2.0    2.000000
      mean   630.000000   200.0  115.500000
      std    183.847763     0.0    6.363961
      min    500.000000   200.0  111.000000
      25%    565.000000   200.0  113.250000
      50%    630.000000   200.0  115.500000
      75%    695.000000   200.0  117.750000
      max    760.000000   200.0  120.000000

In [87]:
df.groupby('Company').describe().transpose()['Microsoft']

Sales  count      2.000000
       mean     115.500000
       std        6.363961
       min      111.000000
       25%      113.250000
       50%      115.500000
       75%      117.750000
       max      120.000000
Name: Microsoft, dtype: float64